[{"title": "Python MLP Model for Humidity Prediction | Freelancer", "description": "I have a substantial database with 33236 records that I will need you to transform into a robust MLP machine learning model. The goal is to predict next month's humidity. \n\nKey requirements:\n- Implementation of the machine learning models should be in Python\n- Utilize known libraries such as Scikit-learn, PyTorch, and TensorFlow\n- Each process should be thoroughly commented for my understanding.\n\nIn addition, I would like the model evaluation to be done using the confusion matrix method. \n\nThe ideal candidate for this project would have:\n- Demonstrable experience in creating MLP models for predictive analysis\n- Proficiency in Python and its popular machine learning libraries\n- Strong understanding of the confusion matrix evaluation method\n- Ability to provide clear, concise and understandable code comments.\n\nPS: I will need the project in 3 days after offer accepted", "budget": "$30-250 USD", "link": "https://www.freelancer.com/projects/python/Python-MLP-Model-for-Humidity/?utm_campaign=latest_project_contest&utm_medium=email_notification&utm_source=project_title&utm_content=html&ttref=Project_LPCNhtml&uniqid=20492886-481124-6697ed2f-207473c2&linkid=23"}, {"title": "Odoo 17 UI Design Overhaul | Freelancer", "description": "I'm seeking an experienced developer to give our Odoo 17's User Interface a complete facelift. \n\nKey Requirements:\n- I'd like changes to the color scheme to make the UI more appealing, modern, and in line with our brand.\n- The layout and organization needs to be optimized for better user experience. This includes restructuring and enhancing the current design.\n- Fonts and typography is also a concern. The new design should be easy to read and visually engaging.\n\nYour Application:\n- Please attach your previous work. Show me the Odoo UI designs you've overhauled in the past.\n- I'm looking for a developer with a proven track record in redesigning software UIs. Be ready to provide references if necessary.", "budget": "$30-250 USD", "link": "https://www.freelancer.com/projects/python/Odoo-Design-Overhaul/?utm_campaign=latest_project_contest&utm_medium=email_notification&utm_source=project_title&utm_content=html&ttref=Project_LPCNhtml&uniqid=20492886-481124-6697fb77-0ceefed3&linkid=35"}, {"title": "Nimble File Organizer and Email Automator | Freelancer", "description": "I am in need of a compact program developed to efficiently organize files into specified folders and send emails, based on metadata. \n\n1. FILE TYPES:\n   - The program should handle a variety of file types, primarily zipped files, .xlsx, and .doc files. \n\n2. ACTIONS REQUIRED:\n   - The application should perform two key functions - moving files to specific folders and sending emails with the processed files as attachments. \n\n3. METADATA UTILIZATION:\n   - The file name will serve as the determining factor for destination folders. The program should parse the file name and use this information to establish its final location.\n  \nIdeal skills and experiences for this project:\n\n- Strong background in programming, particularly with file handling and email automation.\n- Previous experience in creating similar file organization and automation systems.\n- Proficient understanding of working with metadata.", "budget": "$30-250 USD", "link": "https://www.freelancer.com/projects/python/Nimble-File-Organizer-Email-Automator/?utm_campaign=latest_project_contest&utm_medium=email_notification&utm_source=project_title&utm_content=html&ttref=Project_LPCNhtml&uniqid=20492886-481124-66980961-38677ef9&linkid=8"}, {"title": "Automated Python Trading Web App | Freelancer", "description": "I'm seeking an experienced Python developer to build a web application with real-time automation capabilities for Indian stock market. \n\nFeatures needed are: \n\n- Real-time stock data updates \n- Autonomouse buying and selling of stocks\n- Comprehensive portfolio management\n\nThe app should be able to handle both NSE (National Stock Exchange) and BSE (Bombay Stock Exchange) data. \n\nAn in-depth understanding of APIs that can retrieve real-time stock data is required. Additionally, a solid grasp of automation and portfolio management in relation to Indian stock markets will be key to this project's success. \n\nWhile the primary users will be individual investors, the web app should have the capacity to scale up in the future for professional traders and stock brokers. \n\nTo reiterate, proficiency in Python, knowledge of stock market trading, and an understanding of real-time data update integration are key skills needed for this execution.", "budget": "₹12500-37500 INR", "link": "https://www.freelancer.com/projects/python/Automated-Python-Trading-Web-App/?utm_campaign=latest_project_contest&utm_medium=email_notification&utm_source=project_title&utm_content=html&ttref=Project_LPCNhtml&uniqid=20492886-481124-66981762-fa215a29&linkid=20"}]